# Rebar Free Form Surface Server Guid Property

Source: https://www.revitapidocs.com/2026/249c123f-33e7-f274-65cf-623470b87807.htm

---

| Rebar Free Form Surface Server Guid Property |
| --- |

Guid used for identifying the external IRebarUpdateServer for computing Surface Free Form Rebar.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static Guid FreeFormSurfaceServerGuid { get; }
```

```
Public Shared ReadOnly Property FreeFormSurfaceServerGuid As Guid
	Get
```

```
public:
static property Guid FreeFormSurfaceServerGuid {
	Guid get ();
}
```

```
static member FreeFormSurfaceServerGuid : Guid with get
```

#### Property Value

Guid See Also

#### Reference

Rebar Class Autodesk.Revit.DB.Structure Namespace